Block.find_or_create_by(name: "Events-опт") do |b|
  b.text = '<div class="row">
              <div class="ident-buttom">
                <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h3>Сервис печати на ткани любой сложности</h3>
                  <p>Пластичность образа имитирует определенный фабульный каркас. Выявляя устойчивые архетипы на примере художественного творчества, можно сказать, что мера аккумулирует определенный реализм. Ролевое поведение многопланово продолжает героический миф. Герменевтика возможна.</p>
                  <p>Аполлоновское начало готично иллюстрирует незначительный механизм эвокации, так Г.Корф формулирует собственную антитезу. Фантазия готично образует текст. Его экзистенциальная тоска выступает как побудительный мотив творчества, однако асинхронность эволюции видов характерна. Богатство мировой литературы от Платона до Ортеги-и-Гассета свидетельствует о том, что эзотерическое многопланово просветляет элитарный комплекс априорной бисексуальности.</p>
                  <h3>Сервис печати на ткани любой сложности</h3>
                  <p>Понтаж, согласно традиционным представлениям, вызывает мимезис. Стиль вызывает персональный фарс. Манерничанье просветляет статус художника. Очевидно, что идея (пафос) характерна.</p>
                </div>
              </div>
            </div>'
  b.title = "Events-опт"
end
Block.find_or_create_by(name: "Оплата и доставка") do |b|
  b.text = '<div class="row">
              <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h2 class="text-center">Мы принимаем и доставляем</h2>
              </div>
            </div>
            <div class="row">
              <div class="ident-buttom">
                <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h3>Доставка</h3>
                  <p><strong>Бесплатная доставка по городу Минску</strong> осуществляется при заказе от 100 000 бел. руб. в пределах МКАД и улиц: Селицкого, Шабаны, Бачило, Ротмистрова, Руссиянова, Шугаева, Никифорова, Академика Купревича, Франциска Скорины, Стариновская, Острошицкая, Уручская, Гинтовта, Городецкая, Ложинская, Шафарнянская, Лопатина.
                  При сумме заказа до 100 000 бел. руб. стоимость доставки на указанные адреса составит – 30 000 бел. руб.</p>
                  <p><strong>Важно:</strong> на все остальные адреса г. Минска и прилегающих населенных пунктов бесплатная доставка возможна при сумме заказа от 350 000 бел. руб. При сумме заказа менее 350 000 бел. руб. стоимость доставки на указанные адреса составит 30 000 бел. руб.</p>
                  <p><strong>Если у вас остались вопросы по стоимости доставки</strong> по вашему адресу вы всегда можете уточнить эту информацию у менеджера интернет-магазина, позвонив по одному из телефонов, указанных в верхней части этой страницы.</p>
                  <p><strong>Доставка осуществляется ежедневно, без выходных, с 11:30 до 22:00.</strong> Если Вы желаете получить свой заказ в другое время, то, пожалуйста, согласуйте время с менеджером интернет-магазина.</p>
                  <h3>Оплата</h3>
                  <p>На данный момент доступна <strong>оплата наличными:</strong> вы расплачиваетесь с курьером наличными деньгами при получении заказа, после проверки комплектности вашего заказа.</p>
                  <p>В случае если вы забираете свой заказ самостоятельно из нашего офиса <strong>(самовывоз),</strong> вы можете рассчитаться пластиковой картой при помощи терминала безналичной оплаты.</p>
                  <p>При пересылке заказа по Республике Беларусь, вы оплачиваете <strong>наложенный платеж</strong> при получении заказа в отделениях РУБ «Белпочта».</p>
                </div>
              </div>
            </div>'
  b.title = "Оплата и доставка"
end
Block.find_or_create_by(name: "Контакты") do |b|
  b.text = '<div class="row">
              <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h2 class="text-center">Обратная связь</h2>
              </div>
            </div>
            <div class="row">
              <div class="ident-buttom">
                <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h3>Контактная информация</h3>
                  <p><strong>Телефон:</strong></p>
                    <ul>
                      <li>+375 29 888 99 88</li>
                      <li>+375 29 888 99 88</li>
                      <li>+375 29 888 99 88</li>
                    </ul>
                  <p><strong>E-mail:</strong></p>
                    <ul>
                      <li>info@goprint.by</li>
                    </ul>
                  <p><strong>Адрес:</strong></p>
                    <ul>
                      <li>г. Минск, ул. Тимирязева 67, офис 625</li>
                    </ul>
                </div>
              </div>
            </div>
            <div class="row">
              <div class="ident-buttom">
                <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h3>Как добраться</h3>
                  <p><strong>На автомобиле</strong><br>
                      С проспекта Независимости:
                  </p>
                    <ul>
                      <li> &#160; &#160;- Сворачиваете на улицу Веры Хоружей к Комаровскому рынку. Доезжаете до перекрестка улиц В.Хоружей и Куйбышева (справа видите большое здание Комаровского рынка).<br>
                      *Рекомендуем машину оставить на паркинге во избежание проблем с ГАИ.
                      </li>
                    </ul>
                  <p><strong>На метро</strong></p>
                    <ul>
                      <li> &#160; &#160;- Вам нужна станция метро площадь Якуба Коласа.</li>
                      <li> &#160; &#160;- Выходите из метро в сторону Комаровского рынка и Торгового центра Импульс</li>
                      <li> &#160; &#160;- Идете прямо, никуда не сворачивая, пока не увидите справа вход на Комаровский рынок. Вам нужно выйти на обратную сторону рынка, пройти его насквозь. Вы окажетесь на улице Кульман. В качестве ориентиров вы можете использовать Дом Быта и стоянку маршрутного такси.</li>
                    </ul><br>
                </div>
              </div>
            </div>'
            b.title = "Контакты"
end
Block.find_or_create_by(name: "Цена") do |b|
  b.text = '<div class="row">
                <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                    <h2 class="text-center text-muted">Заказы на наших майках и на майках клиента</h2>
                </div>
              </div>
              <div class="row">
                <div class="ident-top">
                  <div class="table-responsive">
                    <table class="table">
                      <thead>
                        <tr>
                          <th>Спецификация</th>
                          <th>Цена, руб</th>
                        </tr>
                      </thead>
                      <tbody>
                        <tr>
                          <td>Майка с рисунком</td>
                          <td>от 190 000</td>
                        </tr>
                        <tr>
                          <td>Майка цветная с рисунком</td>
                          <td>от 210 000</td>
                        </tr>
                        <tr>
                          <td>Майка клиента (только нанесение рисунка)</td>
                          <td>от 80 000</td>
                        </tr>
                        <tr>
                          <td>Каждая последующая графика</td>
                          <td>Индивидуально</td>
                        </tr>
                        <tr>
                          <td>Экспресс нанесение</td>
                          <td>+ 50 000 к цене</td>
                        </tr>
                      </tbody>
                    </table>
                  </div>
                </div>
              </div>

              '
  b.title = "Цена"
end
Block.find_or_create_by(name: "Майки") do |b|
  b.text = '<div class="row">
              <div class="col-xs-12 col-sm-12 col-md-12 col-lg-12">
                  <h2 class="text-center">Печать высокого качества на майках</h2>
              </div>
            </div>'
  b.title = "Майки"
end
Block.find_or_create_by(name: "Главная") do |b|
  b.title = "Главная"
end
Block.find_or_create_by(name: "Новости") do |b|
  b.title = "Новости"
end


